Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: export const header = { title: 'Quick start guide to building applications on AT Protocol', description: 'In this guide, we\'re going to build a simple multi-user app that publishes your current "status" as an emoji.', }
ja: export const header = { title: 'ATプロトコルでアプリケーションを構築するためのクイックスタートガイド', description: 'このガイドでは、「ステータス」を絵文字として公開するシンプルなマルチユーザーアプリを構築します。', }

source: export const header = { title: 'Reading Data', description: 'Read AT Protocol Records', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'データ読み取り', description: 'ATプロトコルレコードを読み取る', }

source: export const header = { title: 'Reads and Writes', description: 'Read and Write AT Protocol Records', }
ja: import {Heading} from '@/components/Heading' export const header = { title: '読み取りと書き込み', description: 'ATプロトコルレコードを読み書きする', }

source: export const header = { title: 'Reads and Writes', description: 'Read and Write from the Atmosphere', }
ja: import {Heading} from '@/components/Heading' export const header = { title: '読み取りと書き込み', description: 'Atmosphereのレコードを読み書きする', }

source: export const header = { title: 'SDK authentication', description: 'Authenticating with the SDKs', }
ja: export const header = { title: 'SDK認証', description: 'SDKでの認証', }

source: export const header = { title: 'Scopes', description: 'OAuth permission scopes and sets', }
ja: export const header = { title: 'スコープ', description: 'OAuthの権限と権限セット', }

source: export const header = { title: 'Self-hosting', description: 'Resources for self-hosting various components of the Atmosphere stack', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'セルフホスティング', description: 'Atmosphereスタックの各コンポーネントをセルフホストするためのリソース', }

source: export const header = { title: 'Social graph', description: 'Working with AT Protocol Social Graphs', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'ソーシャルグラフ', description: 'ATプロトコルのソーシャルグラフの操作', }

source: export const header = { title: 'Streaming Data', description: 'Working with the Firehose and Jetstream', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'データストリーミング', description: 'firehoseとJetstreamの使用', }

source: export const header = { title: 'Subscriptions', description: 'Subscribing to a labeler service', }
ja: export const header = { title: '登録', description: 'ラベラーサービスの登録', }

source: export const header = { title: 'Sync', description: 'Synchronizing AT Protocol data', }
ja: import {Heading} from '@/components/Heading' export const header = { title: '同期', description: 'ATプロトコルデータの同期', }

source: export const header = { title: 'The AT Stack', description: 'Components of the AT Protocol Stack', }
ja: export const header = { title: 'ATスタック', description: 'ATプロトコルスタックを構成するもの', }

source: export const header = { title: 'Tutorials', // description: 'AT Protocol Tutorials', }
ja: export const header = { title: 'チュートリアル', // description: 'ATプロトコルチュートリアル集', }

source: export const header = { title: 'Understanding Atproto', description: 'A closer look into how it all works', }
ja: export const header = { title: 'atprotoを知る', description: '全体の仕組みの深掘り', }

source: export const header = { title: 'Using Ozone', description: 'Working with the Ozone moderation interface', }
ja: export const header = { title: 'Ozoneの利用', description: 'Ozoneモデレーションインターフェースの運用', }

source: export const header = { title: 'Video Handling', description: 'Handling video uploads and processing', }
ja: import {Heading} from '@/components/Heading' export const header = { title: '動画の取り扱い', description: '動画のアップロードと処理', }

source: export const header = { title: 'We can just build things', description: 'Create high-scale social applications that are interoperable by default.', primaryCTA: { label: 'Intro', href: '/guides/understanding-atproto', }, secondaryCTA: { label: 'SDKs', href: '/sdks', }, }
ja: export const header = { title: 'まずは作ろう', description: '相互運用可能な大規模ソーシャルアプリケーションを作成しましょう', primaryCTA: { label: '導入', href: '/guides/understanding-atproto', }, secondaryCTA: { label: 'SDK', href: '/sdks', }, }

source: export const header = { title: 'Write a Custom Feed', description: 'Host an algorithm that\'s accessible from apps like Bluesky.', }
ja: export const header = { title: 'カスタムフィード作成', description: 'Blueskyのようなアプリからアクセス可能なアルゴリズムのホスト', }

source: export const header = { title: 'Writing Data', description: 'Write AT Protocol Records', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'データ書き込み', description: 'ATプロトコルレコードを書き込む', }

source: export const metadata = { title: 'Data Validation', description: 'Expectations around recommended data limits and validation', }
ja: import {Heading} from '@/components/Heading' export const metadata = { title: 'データバリデーション', description: '推奨されるデータ制限とバリデーションに期待するもの', }

source: export default function DocsHome() { return ( <div className="flex flex-1 flex-col gap-16 px-8 pb-16 pt-16 xl:max-w-6xl xl:px-16"> <Usecases /> <div className="grid gap-6 md:grid-cols-2"> <NavItem icon="key" title="Auth" description="Login and permissions" href="/guides/auth" /> <NavItem icon="database" title="Reads / Writes" description="User data repos" href="/guides/reads-and-writes" /> <NavItem icon="stream" title="Sync" description="Stream user activity" href="/guides/sync" /> <NavItem icon="puzzle-piece" title="Lexicon" description="Record and API schemas" href="/guides/lexicon" /> <NavItem icon="media" title="Images & Videos" description="Solve your CDN" href="/guides/images-and-video" /> <NavItem icon="flag" title="Moderation" description="Composable trust and safety" href="/guides/moderation" /> </div> </div> ) }
ja: export default function DocsHome() { return ( <div className="flex flex-1 flex-col gap-16 px-8 pb-16 pt-16 xl:max-w-6xl xl:px-16"> <Usecases /> <div className="grid gap-6 md:grid-cols-2"> <NavItem icon="key" title="認証" description="ログインと権限" href="/guides/auth" /> <NavItem icon="database" title="読み書き" description="データリポジトリ" href="/guides/reads-and-writes" /> <NavItem icon="stream" title="同期" description="ストリーミング" href="/guides/sync" /> <NavItem icon="puzzle-piece" title="Lexicon" description="レコードとAPIのスキーマ" href="/guides/lexicon" /> <NavItem icon="media" title="画像と動画" description="CDN利用" href="/guides/images-and-video" /> <NavItem icon="flag" title="モデレーション" description="安全と信頼の組み立て" href="/guides/moderation" /> </div> </div> ) }

source: fmt.Printf("URI: %s\n", resp.Uri) // resp.Value contains the record data ``` </TabPanel> </TabPanels> </TabGroup>
ja: fmt.Printf("URI: %s\n", resp.Uri) // resp.Valueにレコードデータが含まれています ``` </TabPanel> </TabPanels> </TabGroup>

source: for (const notif of notifications.notifications) { // Only process unread mentions if (notif.reason !== 'mention' || notif.isRead) continue
ja: for (const notif of notifications.notifications) { // 未読メンションのみを処理 if (notif.reason !== 'mention' || notif.isRead) continue

source: for API endpoints, mention in the description if authentication is required, and whether responses will be personalized if authentication is optional
ja: APIエンドポイントの場合、descriptionに認証が必須かどうか、認証がオプションの場合にレスポンスがパーソナライズされるかどうかを記載してください

source: for example, in an API response listing accounts (DIDs), return an array of objects each with an `account` field listing the DID, instead of an array of strings
ja: 例えば、アカウント（DID）を一覧するAPIレスポンスでは、文字列の配列の代わりに、DID用の`account`フィールドを持つオブジェクトの配列を返してください

source: for more details see ["Why RichText facets in Bluesky"](https://www.pfrazee.com/blog/why-facets)
ja: 詳細については、[『Why RichText facets in Bluesky』](https://www.pfrazee.com/blog/why-facets)を参照してください

source: if (!agent) { // Serve the logged-out view return res.type('html').send(page(home())) }
ja: if (!agent) { // ログアウトビューを提供します return res.type('html').send(page(home())) }

source: if the `cursor` is in the future (higher than the current sequence), an error is returned and the connection closed
ja: `cursor`が未来を指す場合（現在のシーケンスより高い）、エラーが返され、接続が閉じられます

source: if the `cursor` is not provided, the server will start returning new messages from the current point forward
ja: `cursor`が提供されない場合、サーバーはその時点以降のメッセージを返し始めます

source: if the `cursor` is older than the earliest available message (or is 0), the server returns an info message of name `OutdatedCursor`, then returns messages starting from the oldest available
ja: `cursor`が最も古い利用可能なメッセージより古い場合（または0の場合）、サーバーは`OutdatedCursor`という名前のメッセージを返した後、最も古い利用可能なものからメッセージを返します

source: if the `cursor` is provided, the server will attempt to return historical messages starting with the matching `seq`, continuing through to the current stream
ja: `cursor`が提供されている場合、サーバーは一致する`seq`で始まる履歴メッセージを返し、現在のストリームまで続きます

source: if the account was previously deleted or inactive for a long time, it is a best practice for the PDS to emit an empty `#commit` event after reactivation to ensure downstream services are synchronized.
ja: もしアカウントが過去に削除または長期間無効化されていた場合、ベストプラクティスは再有効化後にPDSが`#commit`イベントを送信して、下流サービスに確実に同期させることです。

source: import Link from 'next/link' import {FooterCTA} from "@/components/FooterCTA" import AppBanner from './app-banner.png' import AppLogin from './app-login.png' import AppScreenshot from './app-screenshot.png' import AppStatusHistory from './app-status-history.png' import AppStatusOptions from './app-status-options.png' import DiagramEventStream from './diagram-event-stream.png' import DiagramInfoFlow from './diagram-info-flow.png' import DiagramOauth from './diagram-oauth.png' import DiagramOptimisticUpdate from './diagram-optimistic-update.png' import DiagramRepo from './diagram-repo.png'
ja: import Link from 'next/link' import {FooterCTA} from "@/components/FooterCTA" import {Heading} from '@/components/Heading' import AppBanner from './app-banner.png' import AppLogin from './app-login.png' import AppScreenshot from './app-screenshot.png' import AppStatusHistory from './app-status-history.png' import AppStatusOptions from './app-status-options.png' import DiagramEventStream from './diagram-event-stream.png' import DiagramInfoFlow from './diagram-info-flow.png' import DiagramOauth from './diagram-oauth.png' import DiagramOptimisticUpdate from './diagram-optimistic-update.png' import DiagramRepo from './diagram-repo.png'

source: import { Card, CardParagraph, CardTitle } from '@/components/Card'
ja: import { Card, CardParagraph, CardTitle } from '@/components/Card' import { Heading } from '@/components/Heading'

source: import { Guides } from '@/components/Guides' import { Specs } from '@/components/Specs' import { HeroPattern } from '@/components/HeroPattern' import { Firehose } from '@/components/Firehose' import { CodeCard } from '@/components/CodeCard' import { ImageCard } from '@/components/ImageCard' import { ArticleSummary, ArticleSummarySmall } from '@/components/ArticleSummary' import { UserIcon } from '@/components/icons/UserIcon' import WebWithoutWallsPng from '@/images/media/web-without-walls.png' import DotMediaInterviewPng from '@/images/media/dotmedia-interview.png' import WhitepaperPng from '@/images/media/whitepaper.png' import HowDoesBlueskyWorkBlogpostPng from '@/images/media/how-does-bsky-work-blogpost.png'
ja: import { Guides } from '@/components/Guides' import { Specs } from '@/components/Specs' import { HeroPattern } from '@/components/HeroPattern' import { Heading } from '@/components/Heading' import { Firehose } from '@/components/Firehose' import { CodeCard } from '@/components/CodeCard' import { ImageCard } from '@/components/ImageCard' import { ArticleSummary, ArticleSummarySmall } from '@/components/ArticleSummary' import { UserIcon } from '@/components/icons/UserIcon' import WebWithoutWallsPng from '@/images/media/web-without-walls.png' import DotMediaInterviewPng from '@/images/media/dotmedia-interview.png' import WhitepaperPng from '@/images/media/whitepaper.png' import HowDoesBlueskyWorkBlogpostPng from '@/images/media/how-does-bsky-work-blogpost.png'

source: import { TabGroup, TabList, Tab, TabPanels, TabPanel } from '@/components/mdx' export const header = { title: 'Feeds', description: 'Creating and consuming custom feed generators', }
ja: import { TabGroup, TabList, Tab, TabPanels, TabPanel } from '@/components/mdx' import {Heading} from '@/components/Heading' export const header = { title: 'フィード', description: 'カスタムフィードジェネレーターの作成と利用', }

source: import {Container} from "@/components/Container"
ja: import {Container} from "@/components/Container" import {Heading} from "@/components/Heading"

source: import {Container} from "@/components/Container" import acknowledged from "./acknowledged.png" import confirm from "./confirm.png" import credentials from "./credentials.png" import eventstream from "./event-stream.png" import labeler from "./labeler-account-view.png" import login from "./login.png" import actions from "./moderation-actions.png" import reported from "./ozone-post-reported.png" import report from "./report-post.png" import reporting from "./reporting-interface.png" import repositories from "./search-repositories.png" import welcome from "./welcome.png" import plc from "./plc-update.png"
ja: import {Container} from "@/components/Container" import {Heading} from "@/components/Heading" import acknowledged from "./acknowledged.png" import confirm from "./confirm.png" import credentials from "./credentials.png" import eventstream from "./event-stream.png" import labeler from "./labeler-account-view.png" import login from "./login.png" import actions from "./moderation-actions.png" import reported from "./ozone-post-reported.png" import report from "./report-post.png" import reporting from "./reporting-interface.png" import repositories from "./search-repositories.png" import welcome from "./welcome.png" import plc from "./plc-update.png"

source: import {Container} from "@/components/Container" import bsky from "./feeds-bsky.png"
ja: import {Container} from "@/components/Container" import {Heading} from "@/components/Heading" import bsky from "./feeds-bsky.png"

source: import {Container} from "@/components/Container" import crawling from "./crawling.png" import did from "./did.png" import feeds from "./feeds.png"
ja: import {Container} from "@/components/Container" import {Heading} from "@/components/Heading" import crawling from "./crawling.png" import did from "./did.png" import feeds from "./feeds.png"

source: import {Container} from "@/components/Container" import moderation from "./moderation.png"
ja: import {Container} from "@/components/Container" import {Heading} from "@/components/Heading" import moderation from "./moderation.png"

source: import {Container} from "@/components/Container" import oauth from "./oauth-only.png" import skyblur from "./skyblur-oauth.png" import granular from "./skyblur-granular.png" import lexicon from "./skyblur-lexicon.png"
ja: import {Container} from "@/components/Container" import {Heading} from "@/components/Heading" import oauth from "./oauth-only.png" import skyblur from "./skyblur-oauth.png" import granular from "./skyblur-granular.png" import lexicon from "./skyblur-lexicon.png"

source: import {Container} from "@/components/Container" import oauthdomain from "./oauth-domain.jpg"
ja: import {Container} from "@/components/Container" import {Heading} from "@/components/Heading" import oauthdomain from "./oauth-domain.jpg"

source: import {Container} from "@/components/Container" import ozone from "./ozone.png"
ja: import {Container} from "@/components/Container" import {Heading} from "@/components/Heading" import ozone from "./ozone.png"

source: import {Container} from "@/components/Container" import setstatus from "./set-status.png" import pdsls from "./pdsls-status.png" import tap from "./tap-status.png" import feed from "./feed-status.png"
ja: import {Container} from "@/components/Container" import {Heading} from "@/components/Heading" import setstatus from "./set-status.png" import pdsls from "./pdsls-status.png" import tap from "./tap-status.png" import feed from "./feed-status.png"

source: import {Container} from "@/components/Container" import workingauth from "./authentication-working.png" import starter from "./nextjs-starter.png" import metadata from "./client-metadata.png"
ja: import {Container} from "@/components/Container" import {Heading} from "@/components/Heading" import workingauth from "./authentication-working.png" import starter from "./nextjs-starter.png" import metadata from "./client-metadata.png"

source: import {Container} from "@/components/Container" import {FooterCTA} from "@/components/FooterCTA" import image1 from "./image1.png" import image2 from "./image2.png" import image3 from "./image3.png" import image4 from "./image4.png" import image5 from "./image5.png" import image6 from "./image6.png" import image7 from "./image7.png" import image8 from "./image8.png" import image9 from "./image9.png" import image10 from "./image10.png" import image11 from "./image11.png" import image12 from "./image12.png" import image13 from "./image13.png" import image14 from "./image14.png" import image15 from "./image15.png" import image16 from "./image16.png" import image17 from "./image17.png" import image18 from "./image18.png" import image19 from "./image19.png" import image20 from "./image20.png" import image21 from "./image21.png" import image22 from "./image22.png" import image23 from "./image23.png" import image24 from './image24.png'
ja: import {Container} from "@/components/Container" import {FooterCTA} from "@/components/FooterCTA" import {Heading} from '@/components/Heading' import image1 from "./image1.png" import image2 from "./image2.png" import image3 from "./image3.png" import image4 from "./image4.png" import image5 from "./image5.png" import image6 from "./image6.png" import image7 from "./image7.png" import image8 from "./image8.png" import image9 from "./image9.png" import image10 from "./image10.png" import image11 from "./image11.png" import image12 from "./image12.png" import image13 from "./image13.png" import image14 from "./image14.png" import image15 from "./image15.png" import image16 from "./image16.png" import image17 from "./image17.png" import image18 from "./image18.png" import image19 from "./image19.png" import image20 from "./image20.png" import image21 from "./image21.png" import image22 from "./image22.png" import image23 from "./image23.png" import image24 from './image24.png'

source: import {Container} from "@/components/Container" import {ResponsiveTable} from '@/components/ResponsiveTable'
ja: import {Container} from "@/components/Container" import {Heading} from "@/components/Heading" import {ResponsiveTable} from '@/components/ResponsiveTable'

source: import {DescriptionList, Description} from '@/components/DescriptionList'
ja: import {DescriptionList, Description} from '@/components/DescriptionList' import {Heading} from '@/components/Heading'

source: import {FooterCTA} from "@/components/FooterCTA"
ja: import {FooterCTA} from "@/components/FooterCTA" import {Heading} from "@/components/Heading"

source: indexer.identity(async (evt) => { if (evt.status === 'active') return // Remove posts from disabled/deleted identities const removed = postIndex.filter(p => p.uri.includes(evt.did)).length if (removed > 0) { postIndex.splice(0, postIndex.length, ...postIndex.filter(p => !p.uri.includes(evt.did))) console.log(`Identity ${evt.did} (${evt.status}): removed ${removed} posts`) } })
ja: indexer.identity(async (evt) => { if (evt.status === 'active') return // 削除/利用停止されたIDからの投稿を除去 const removed = postIndex.filter(p => p.uri.includes(evt.did)).length if (removed > 0) { postIndex.splice(0, postIndex.length, ...postIndex.filter(p => !p.uri.includes(evt.did))) console.log(`Identity ${evt.did} (${evt.status}): removed ${removed} posts`) } })

source: is actually just an HTTP request:
ja: これは実質的にただのHTTPリクエストです。

source: it must be a well-formed URL, following the W3C URL specification
ja: W3CのURL仕様に従った正しい形式のURLである必要があります

source: left to go.
ja: あと少しです。

source: let uri try { // Write the status record to the user's repository const res = await agent.com.atproto.repo.putRecord({ repo: agent.assertDid, collection: 'xyz.statusphere.status', rkey: TID.nextStr(), record, }) uri = res.uri } catch (err) { logger.warn({ err }, 'failed to write record') return res.status(500).json({ error: 'Failed to write record' }) }
ja: let uri try { // ステータスレコードをユーザーのリポジトリに書き込みます const res = await agent.com.atproto.repo.putRecord({ repo: agent.assertDid, collection: 'xyz.statusphere.status', rkey: TID.nextStr(), record, }) uri = res.uri } catch (err) { logger.warn({ err }, 'failed to write record') return res.status(500).json({ error: 'Failed to write record' }) }

source: make unions “open” in almost all situations, to allow future addition of types or values
ja: ほぼすべての状況で共用体を「open」にして、将来的な型や値の追加を許可してください

source: mentioned users
ja: メンションされたユーザー

source: moderation settings
ja: モデレーションの設定

source: more powerful systems like Markdown are more appropriate for long-form text
ja: Markdownのような強力なシステムは、長文テキストに適しています

source: new Firehose({ filterCollections: ['xyz.statusphere.status'], handleEvent: async (evt) => { // Watch for write events if (evt.event === 'create' || evt.event === 'update') { const record = evt.record
ja: new Firehose({ filterCollections: ['xyz.statusphere.status'], handleEvent: async (evt) => { // 書き込みイベントを監視する if (evt.event === 'create' || evt.event === 'update') { const record = evt.record

source: now
ja: 今

source: once the account creation has completed, and the PDS will respond with `active` to API requests for account status, an `#account` event can be emitted
ja: アカウント作成が完了したら、PDSはアカウント状態に関するAPIに対して`active`で応答するようになり、`#account`イベントを送信します。

source: open unions can be an extension mechanism for third parties to include self-defined data types
ja: オープンな共用体は、サードパーティが自己定義されたデータ型を含めるための拡張メカニズムです

source: or defining both `app.bsky.feed` (as a record) and `app.bsky.feed.post` (with `app.bsky.feed` as a group)
ja: または`app.bsky.feed`（レコード）と`app.bsky.feed.post`（`app.bsky.feed`はグループ）の両方を定義すること

source: private preferences
ja: 非公開設定

source: profile
ja: プロフィール

source: public blobs (media files)
ja: 公開blob（メディアファイル）

source: public repository
ja: 公開リポジトリ

source: publishing schemas to and synchronizing from the AT network
ja: スキーマを公開してATネットワークと同期する

source: putting these in a separate schema file means that deprecation or removal of other schema files doesn’t impact reuse
ja: 個別のスキーマファイルに取り分けると、他のスキーマファイルの廃止や削除が再利用に影響しなくなります

source: query parameters include an optional `limit` (integer) and optional`cursor` (string)
ja: クエリパラメータにはオプションの`limit`（整数）とオプションの`cursor`（文字列）が含まれます

source: read about how to use search filters
ja: 検索フィルタの使い方を読む

source: reduced bandwidth, and compression
ja: 帯域幅の削減と圧縮

source: resp, _ := comatproto.RepoCreateRecord(ctx, client, &comatproto.RepoCreateRecord_Input{ Repo: client.Auth.Did, // handle or DID Collection: "app.bsky.feed.post", // lexicon Record: &lexutil.LexiconTypeDecoder{Val: post}, }) ``` `Text` and `CreatedAt` are required values under the [`app.bsky.feed.post` Lexicon](https://atproto.blue/en/latest/atproto/atproto_client.models.app.bsky.feed.post.html).
ja: resp, _ := comatproto.RepoCreateRecord(ctx, client, &comatproto.RepoCreateRecord_Input{ Repo: client.Auth.Did, // handle or DID Collection: "app.bsky.feed.post", // lexicon Record: &lexutil.LexiconTypeDecoder{Val: post}, }) ``` `Text`と`CreatedAt`は[`app.bsky.feed.post` Lexicon](https://atproto.blue/en/latest/atproto/atproto_client.models.app.bsky.feed.post.html)において必須の値です。
